app/controllers/authors_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]
---
  def show
    # @author = Author.find(params[:id])
    @post = Post.find(params[:id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 1]]
SELECT "authors".* FROM "authors"
---
  def posts_index
    # @author = Author.find(params[:id])
    # @posts = @author.posts
    # render template: 'posts/index'
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all